БухЭксп/Reports/CW_АнализРаспределенияЗатратПоПутевымЛистам.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Report>
		<Properties>
			<Name>CW_АнализРаспределенияЗатратПоПутевымЛистам</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>АдресНастроек</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Report>
</MetaDataObject>

БухЭксп/Enums/CW_НаправлениеСортировки.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>CW_НаправлениеСортировки</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ПоВозрастанию</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПоУбыванию</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

БухЭксп/ChartsOfCharacteristicTypes/CW_ПараметрыГрузоперевозок.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<ChartOfCharacteristicTypes>
		<Properties>
			<Name>CW_ПараметрыГрузоперевозок</Name>
			<Type>
				<v8:Type>cfg:CatalogRef.Склады</v8:Type>
				<v8:Type>cfg:CatalogRef.CW_ЖелезнодорожныеСтанции</v8:Type>
				<v8:Type>cfg:CatalogRef.КлассификаторДОПОГЭПД</v8:Type>
				<v8:Type>cfg:CatalogRef.CW_Заявки</v8:Type>
				<v8:Type>cfg:CatalogRef.CW_СкладыВременногоХранения</v8:Type>
				<v8:Type>cfg:CatalogRef.ОсновныеСредства</v8:Type>
				<v8:Type>cfg:CatalogRef.CW_РазмерыКонтейнеров</v8:Type>
				<v8:Type>cfg:CatalogRef.CW_ТранспортныеСредства</v8:Type>
				<v8:Type>cfg:CatalogRef.CW_ОфисыКомпании</v8:Type>
				<v8:Type>cfg:CatalogRef.CW_Оборудование</v8:Type>
				<v8:Type>cfg:CatalogRef.CW_Линии</v8:Type>
				<v8:Type>cfg:CatalogRef.CW_Порты</v8:Type>
				<v8:Type>cfg:CatalogRef.ДоговорыКонтрагентов</v8:Type>
				<v8:Type>cfg:CatalogRef.НомераГТД</v8:Type>
				<v8:Type>cfg:CatalogRef.CW_Заказы</v8:Type>
				<v8:Type>cfg:CatalogRef.СтраныМира</v8:Type>
				<v8:Type>cfg:CatalogRef.CW_Авиалинии</v8:Type>
				<v8:Type>cfg:CatalogRef.CW_ТипоразмерыКонтейнеров</v8:Type>
				<v8:Type>xs:boolean</v8:Type>
				<v8:Type>cfg:CatalogRef.CW_ТипыДоговоров</v8:Type>
				<v8:Type>cfg:CatalogRef.CW_ОбъектыАрхива</v8:Type>
				<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
				<v8:Type>cfg:CatalogRef.CW_ГрузоотправителиИГрузополучатели</v8:Type>
				<v8:Type>cfg:CatalogRef.CW_ТипыПеревозок</v8:Type>
				<v8:Type>cfg:CatalogRef.CW_ТипыКонтейнеров</v8:Type>
				<v8:Type>cfg:EnumRef.CW_РеестрыНДС0Приложения</v8:Type>
				<v8:Type>cfg:CatalogRef.КонтактныеЛица</v8:Type>
				<v8:Type>cfg:CatalogRef.ПодразделенияОрганизаций</v8:Type>
				<v8:Type>cfg:CatalogRef.CW_Суда</v8:Type>
				<v8:Type>cfg:CatalogRef.CW_Грузоперевозки</v8:Type>
				<v8:Type>cfg:CatalogRef.CW_ДополнительныеЗначенияПараметровГрузоперевозок</v8:Type>
				<v8:Type>cfg:CatalogRef.CW_МоделиТС</v8:Type>
				<v8:Type>cfg:CatalogRef.КлассификаторТНВЭД</v8:Type>
				<v8:Type>xs:string</v8:Type>
				<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
				<v8:Type>cfg:CatalogRef.CW_ПодразделенияКомпании</v8:Type>
				<v8:Type>cfg:CatalogRef.CW_Рейсы</v8:Type>
				<v8:Type>cfg:CatalogRef.КлассификаторЕдиницИзмерения</v8:Type>
				<v8:Type>xs:dateTime</v8:Type>
				<v8:Type>cfg:CatalogRef.CW_ГруппыУслуг</v8:Type>
				<v8:Type>xs:decimal</v8:Type>
				<v8:Type>cfg:CatalogRef.CW_ДоговорыПоГрузоперевозкам</v8:Type>
				<v8:Type>cfg:CatalogRef.CW_МаркиТС</v8:Type>
				<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
				<v8:Type>cfg:CatalogRef.CW_ОтслеживаемоеОборудование</v8:Type>
				<v8:Type>cfg:CatalogRef.CW_МаршрутыГрузоперевозок</v8:Type>
				<v8:Type>cfg:CatalogRef.Организации</v8:Type>
				<v8:Type>cfg:CatalogRef.КлассификаторУпаковкиЭПД</v8:Type>
				<v8:Type>cfg:CatalogRef.CW_ПриложенияКДоговорам</v8:Type>
				<v8:Type>cfg:CatalogRef.CW_Терминалы</v8:Type>
				<v8:Type>cfg:CatalogRef.CW_КлассификаторОпасныхГрузов</v8:Type>
				<v8:Type>cfg:CatalogRef.CW_Пункты</v8:Type>
				<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
				<v8:Type>cfg:CatalogRef.CW_Таможни</v8:Type>
				<v8:Type>cfg:CatalogRef.CW_ТипыТранспортныхСредств</v8:Type>
				<v8:Type>cfg:CatalogRef.CW_СтатусыОтслеживаемогоОборудования</v8:Type>
				<v8:Type>cfg:CatalogRef.CW_Аэропорты</v8:Type>
				<v8:Type>cfg:CatalogRef.CW_КонтактнаяИнформация</v8:Type>
				<v8:Type>cfg:CatalogRef.CW_Грузы</v8:Type>
				<v8:Type>cfg:CatalogRef.CW_КонтактыеЛица</v8:Type>
				<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
				<v8:NumberQualifiers>
					<v8:Digits>18</v8:Digits>
					<v8:FractionDigits>4</v8:FractionDigits>
				</v8:NumberQualifiers>
				<v8:StringQualifiers>
					<v8:Length>600</v8:Length>
				</v8:StringQualifiers>
				<v8:DateQualifiers>
					<v8:DateFractions>DateTime</v8:DateFractions>
				</v8:DateQualifiers>
			</Type>
			<Hierarchical>true</Hierarchical>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ВариантОтбора</Name>
					<Type>
						<v8:Type>cfg:EnumRef.CW_ВариантыОтбораДляПараметров</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВнешняяОбработка</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CW_ПодключаемыеОбъекты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВнешняяОбработкаИзменения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CW_ПодключаемыеОбъекты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВнешняяОбработкаОтбора</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CW_ПодключаемыеОбъекты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВнешняяОбработкаПередНачаломВыбора</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CW_ПодключаемыеОбъекты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДействиеПриИзменении</Name>
					<Type>
						<v8:Type>cfg:EnumRef.CW_ДействияПриИзмененииКонтрольнойДаты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДинамическийПараметр</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЕжедневныйПересчет</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Идентификатор</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>105</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИдентификаторПлан</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>105</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИдентификаторФакт</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>105</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИндексПиктограммы</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИспользованиеОтбора</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИспользованиеУсловногоОформления</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИспользоватьФормуВводаАдреса</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИспользоватьФормуВыбораОбъекта</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИспользуетсяОбработкаПередНачаломВыбора</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИспользуютсяДополнительныеЗначения</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КонтрольИзменения</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КонтрольнаяДатаИспользуетВремя</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЛимитПросрочкиКонтрольнойДаты</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МножественноеПрямоеРедактирование</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НеПоказыватьВФормеГрузоперевозок</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОбработкаИзменения</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОграниченСпискомЗначений</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Описание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОчищатьПриКопировании</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПараметрОтметкиУведомления</Name>
					<Type>
						<v8:Type>cfg:ChartOfCharacteristicTypesRef.CW_ПараметрыГрузоперевозок</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПодготовленнаяФормула</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПрямоеРедактирование</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Служебный</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СохранятьПолноеЗначениеПараметра</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТолькоПросмотр</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УчетнаяЗапись</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CW_УчетныеЗаписиЭлектроннойПочты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФорматВывода</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Формула</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ХранилищеУсловногоОформления</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Шаблон</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CW_ШаблоныСтандартныхПисем</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЭтоВедомыйПараметр</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЭтоКонтрольнаяДата</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЭтоСсылочныйТип</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЭтоЧисло</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ПараметрыОтбора</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>РеквизитОтбора</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>150</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИспользоватьПГ</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВидУсловия</Name>
							<Type>
								<v8:Type>cfg:EnumRef.CW_ВидыУсловийОтбораПараметров</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
								<v8:Type>xs:string</v8:Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:TypeSet>cfg:EnumRef</v8:TypeSet>
								<v8:TypeSet>cfg:ChartOfCharacteristicTypesRef</v8:TypeSet>
								<v8:TypeSet>cfg:ChartOfAccountsRef</v8:TypeSet>
								<v8:TypeSet>cfg:CatalogRef</v8:TypeSet>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
								<v8:StringQualifiers>
									<v8:Length>10</v8:Length>
								</v8:StringQualifiers>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ИспользуемыеПараметры</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Параметр</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.CW_ПараметрыГрузоперевозок</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ДоступныеЗначения</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ДоступноеЗначение</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.CW_ПараметрыГрузоперевозок</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ВедущиеПараметры</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Параметр</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.CW_ПараметрыГрузоперевозок</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</ChartOfCharacteristicTypes>
</MetaDataObject>

БухЭксп/Reports/CW_АнализРаспределенияЗатратПоПутевымЛистам/Forms/ФормаОтчета/Ext/Form/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ЭтоВнешнийВызов = Ложь;
	Если Параметры.Свойство("ВнешнийВызов") Тогда
		ЭтоВнешнийВызов = Параметры.ВнешнийВызов;
	КонецЕсли;
	
	Если ЭтоВнешнийВызов Тогда
		СформироватьПриОткрытии = ЭтоВнешнийВызов;
		ЭтоВнешнийВызов 		= ложь;
		
		НачалоПериода = Параметры.НачалоПериода;
		КонецПериода  = Параметры.КонецПериода;
		
		Если Параметры.Свойство("Отбор") Тогда
			стрОтбор = Параметры.Отбор;
		КонецЕсли;
		
		Если (Показатели.Количество() = 0) Тогда
			
			Показатели.Добавить("ОборотПоСчету"		, "Оборот по Дт Счета 20.01",Истина);
			Показатели.Добавить("СуммаРаспределено"	, "Распределено"				,Истина);
			Показатели.Добавить("Разница"			, "Разница"					,Истина);
			
						
		КонецЕсли; 
		
		// группировки
		Нстр = Группировки.Добавить();
		Нстр.ИмяПоля = "Организация";
		Нстр.Представление = "Организация";
		Нстр.Сортировка = Перечисления.CW_НаправлениеСортировки.ПоВозрастанию;
		
		Нстр = Группировки.Добавить();
		Нстр.ИмяПоля = "СтатьяЗатрат";
		Нстр.Представление = "Статья затрат";
		Нстр.Сортировка = Перечисления.CW_НаправлениеСортировки.ПоВозрастанию;
		// --- 
		Нстр = Группировки.Добавить();
		Нстр.ИмяПоля = "НоменклатурнаяГруппа";
		Нстр.Представление = "Номенклатурная группа";
		Нстр.Сортировка = Перечисления.CW_НаправлениеСортировки.ПоВозрастанию;

	Иначе
		
		// группировки
		Нстр = Группировки.Добавить();
		Нстр.ИмяПоля = "Организация";
		Нстр.Представление = "Организация";
		Нстр.Сортировка = Перечисления.CW_НаправлениеСортировки.ПоВозрастанию;
		
		Нстр = Группировки.Добавить();
		Нстр.ИмяПоля = "СтатьяЗатрат";
		Нстр.Представление = "Статья затрат";
		Нстр.Сортировка = Перечисления.CW_НаправлениеСортировки.ПоВозрастанию;
		// --- 
		Нстр = Группировки.Добавить();
		Нстр.ИмяПоля = "НоменклатурнаяГруппа";
		Нстр.Представление = "Номенклатурная группа";
		Нстр.Сортировка = Перечисления.CW_НаправлениеСортировки.ПоВозрастанию;
		
		_ВосстановитьСеансовуюНастройку();
		
	КонецЕсли;
	_УправлениеЭлементамиФормы();
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	Элементы.ФормаНастройка.Пометка = Истина;
	
	Если СформироватьПриОткрытии Тогда
		СформироватьПриОткрытии=Ложь;
		
		// ------
		Если ЗначениеЗаполнено(стрОтбор) Тогда
			Отчет.КомпоновщикНастроек.Настройки.Отбор.Элементы.Очистить();
			Отчет.КомпоновщикНастроек.ФиксированныеНастройки.Отбор.Элементы.Очистить();
			
			КомпоновщикНастроекОтбор =  Отчет.КомпоновщикНастроек.Настройки.Отбор;
			Для Каждого ЭлементСтркутуры из стрОтбор Цикл				
				Если  ЗначениеЗаполнено(ЭлементСтркутуры.Значение) Тогда
					НовыйЭлементОтбора = КомпоновщикНастроекОтбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
					ПолеОтбора = Новый ПолеКомпоновкиДанных(ЭлементСтркутуры.Ключ);
					НовыйЭлементОтбора.ЛевоеЗначение = ПолеОтбора;
					НовыйЭлементОтбора.Использование = Истина;
					НовыйЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
					НовыйЭлементОтбора.ПравоеЗначение = ЭлементСтркутуры.Значение;
				КонецЕсли;
			КонецЦикла;
		КонецЕсли;
		// ------
		
		СформироватьОтчет();
	Иначе
		_ВосстановитьСтандартныеНастройки();
		_ВосстановитьСеансовуюНастройку();
	КонецЕсли; 
	
	// период по умолчанию
	Если НЕ ЗначениеЗаполнено(НачалоПериода) ИЛИ НЕ ЗначениеЗаполнено(КонецПериода) Тогда
		НачалоПериода = НачалоМесяца(ТекущаяДата());
		КонецПериода  = КонецМесяца(ТекущаяДата());
	КонецЕсли;	
	
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытием(Отказ, СтандартнаяОбработка)
	
	//_СохранитьСеансовуюНастройку();
	ВариантМодифицирован = Ложь;		
	
КонецПроцедуры

// ---------------------------------------------------------------------------- 

&НаСервере
Процедура _ВосстановитьСтандартныеНастройки()
	
	Отчет.КомпоновщикНастроек.ЗагрузитьНастройки(Отчеты.CW_АнализРаспределенияЗатратПоПутевымЛистам.ПолучитьМакет("ОсновнаяСхемаКомпоновкиДанных").НастройкиПоУмолчанию);
	
КонецПроцедуры	

&НаСервере
Процедура _ВосстановитьСеансовуюНастройку()
	// --- 
	
	// пытаемся восстановить настройки
	Идентификатор = РеквизитФормыВЗначение("Отчет").Метаданные().Имя;
	СеансоваяНастройка = ХранилищеСистемныхНастроек.Загрузить(Идентификатор, "Сеансовая");
	Если СеансоваяНастройка <> Неопределено Тогда
		Попытка
			
			СеансоваяНастройка.Свойство("Показатели",Показатели);
			СеансоваяНастройка.Свойство("ОбъединитьГруппировки", ОбъединитьГруппировки);
			Группировки.Загрузить(СеансоваяНастройка.Группировки);
			
		Исключение
		    //ОписаниеОшибки()
		КонецПопытки; 
		
		
	КонецЕсли; 
	
	Показатели.Очистить();
	
	Если (Показатели.Количество() = 0) Тогда
		
		Показатели.Добавить("ОборотПоСчету"		, "Оборот по Дт Счета 20.01",Истина);
		Показатели.Добавить("СуммаРаспределено"	,"Распределено"				,Истина);
		Показатели.Добавить("Разница"			,"Разница"					,Истина);
		
	КонецЕсли; 
	
	// --- 
КонецПроцедуры

&НаСервере
Процедура _СохранитьСеансовуюНастройку()
	// --- 
	
	СтруктураНастройки = Новый Структура();
	// --- 
	СтруктураНастройки.Вставить("Показатели",Показатели);
	СтруктураНастройки.Вставить("Группировки",Группировки.Выгрузить());
	СтруктураНастройки.Вставить("ОбъединитьГруппировки", ОбъединитьГруппировки);
	// --- 
	Идентификатор = РеквизитФормыВЗначение("Отчет").Метаданные().Имя;
	ХранилищеСистемныхНастроек.Сохранить(Идентификатор, "Сеансовая", СтруктураНастройки);
	
	// --- 
КонецПроцедуры

// ---------------------------------------------------------------------------- 

&НаСервере
Функция _УправлениеЭлементамиФормы()
	// --- 
	
	// --- 
	
	// --- 
КонецФункции
 

&НаКлиенте
Процедура Сформировать(Команда)
	
	_Настройка(Истина);
	СформироватьОтчет();
	
КонецПроцедуры

&НаКлиенте
Процедура СформироватьОтчет()
	// --- 
	
	// записываем настройки во временное хранилище
	Отчет.АдресНастроек = _ПолучитьАдресНастроек();
	ЭтаФорма.СкомпоноватьРезультат();
	ОбработатьОтчет();
	
	СформироватьПриОткрытии = ложь;	
	// --- 
	_СохранитьСеансовуюНастройку();
	
	// --- 
КонецПроцедуры

&НаСервере
Функция _ПолучитьАдресНастроек()
	// --- 
	
	Настройки = _сф.ст_Создать("НачалоПериода,КонецПериода,Организация,Показатели,Разделы,Группировки,ОбъединитьГруппировки");
	Настройки.НачалоПериода = НачалоПериода;
	Настройки.КонецПериода = КонецПериода;
	Настройки.Организация = Организация;
	Настройки.Показатели = Показатели;
	Настройки.Разделы = Разделы;
	Настройки.Группировки = Группировки.Выгрузить();
	Настройки.ОбъединитьГруппировки = ОбъединитьГруппировки;
	
	Возврат(ПоместитьВоВременноеХранилище(Настройки,ЭтаФорма.УникальныйИдентификатор));
	
	// --- 
КонецФункции

&НаСервере
Процедура ОбработатьОтчет()
	
	//CW_Отчеты.ЗаменитьТекстВТаблицеРезультата(Результат, "Итого", "ИТОГО:");	
	
	Результат.УдалитьОбласть(Результат.Область("R1"), ТипСмещенияТабличногоДокумента.ПоГоризонтали); 
	Результат.УдалитьОбласть(Результат.Область("R2"), ТипСмещенияТабличногоДокумента.ПоГоризонтали); 
	Результат.ФиксацияСверху = Результат.ФиксацияСверху - 2;
	
	Результат.ОриентацияСтраницы = ОриентацияСтраницы.Ландшафт;
	Результат.АвтоМасштаб = Истина;
	
КонецПроцедуры	

// ---------------------------------------------------------------------------- 

&НаКлиенте
Процедура Настройка(Команда)
	
	_Настройка(); 
	
КонецПроцедуры

&НаСервере
Процедура _Настройка(Скрыть=Ложь)
	// --- 
	
	Если Скрыть Тогда
		
		Элементы.ГруппаНастройкиОтчета.Видимость = Ложь;
		Элементы.ФормаНастройка.Пометка=Ложь;
		
	Иначе
		
		Если Элементы.ГруппаНастройкиОтчета.Видимость Тогда
			
			Элементы.ГруппаНастройкиОтчета.Видимость = Ложь;
			Элементы.ФормаНастройка.Пометка=Ложь;
			
		Иначе
			
			Элементы.ГруппаНастройкиОтчета.Видимость = Истина;
			Элементы.ФормаНастройка.Пометка=Истина;
			
		КонецЕсли; 
		
	КонецЕсли; 
		
	// --- 
КонецПроцедуры

// ---------------------------------------------------------------------------- 

&НаКлиенте
Процедура ГруппировкиПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа)
	
	Отказ = Истина;
	// --- 
	ПОВ = Новый ОписаниеОповещения("ОбработкаДобавленияГруппировки",ЭтотОбъект); 
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("СхемаКомпоновкиДанных", ПолучитьURLСхемы());
	ПараметрыФормы.Вставить("Режим"          , "Группировка");
	ПараметрыФормы.Вставить("ИсключенныеПоля", ПолучитьЗапрещенныеПоля("Группировка"));
	ПараметрыФормы.Вставить("ТекущаяСтрока"  , Неопределено);
	ОткрытьФорму("ОбщаяФорма.CW_ФормаВыбораДоступногоПоля", ПараметрыФормы,Элемент,,,,ПОВ,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);

КонецПроцедуры

&НаКлиенте
Процедура ОбработкаДобавленияГруппировки(Ответ, ДополнительныеПараметры) Экспорт
	// --- 
	
	Если (Ответ <> Неопределено) Тогда
		
		Если (Ответ <> КодВозвратаДиалога.Отмена) Тогда
			
			Нстр = Группировки.Добавить();
			Ответ.Свойство("Поле", Нстр.ИмяПоля);
			Ответ.Свойство("Заголовок", Нстр.Представление);
			Нстр.Сортировка = ПредопределенноеЗначение("Перечисление.CW_НаправлениеСортировки.ПоВозрастанию");
			
		КонецЕсли; 
		
	КонецЕсли; 
	
	// --- 
КонецПроцедуры
  

&НаСервере
Функция _ПолучитьСписокДоступныхГруппировок()
	// --- 
	
	//Возврат(_сф.сп_ОтобратьПоПометке(СписокГруппировок,Ложь));
	
	// --- 
КонецФункции

&НаКлиенте
Процедура ГруппировкиПередУдалением(Элемент, Отказ)
	
	//УдаляемаяСтрока = Группировки.НайтиПоИдентификатору(Элементы.Группировки.ТекущаяСтрока);
	//Стр = СписокГруппировок.НайтиПоЗначению(УдаляемаяСтрока.ИмяПоля);
	//Если Стр <> Неопределено Тогда
	//	Стр.Пометка = Ложь;	
	//КонецЕсли; 
	
КонецПроцедуры

&НаКлиенте
Функция ПолучитьЗапрещенныеПоля(Режим = "") Экспорт
	
	СписокПолей = Новый Массив;
	
	СписокПолей.Добавить("UserFields");
	СписокПолей.Добавить("DataParameters");
	СписокПолей.Добавить("SystemFields");
	СписокПолей.Добавить("Показатели");
	СписокПолей.Добавить("Период");
		
	Если Режим = "Группировка" Тогда
		//СписокПолей.Добавить("Регистратор");
		
		Для Каждого Стр Из Отчет.КомпоновщикНастроек.Настройки.ДоступныеПоляВыбора.Элементы Цикл
			Если Стр.Папка ИЛИ Стр.Таблица ИЛИ (Найти(Стр.Поле, "удалить") <> 0) Тогда
				СписокПолей.Добавить(Строка(Стр.Поле));
			КонецЕсли; 
		КонецЦикла;
	КонецЕсли;
	
	Возврат Новый ФиксированныйМассив(СписокПолей);
	
КонецФункции

// ---------------------------------------------------------------------------- 

&НаКлиенте
Процедура РезультатОбработкаРасшифровки(Элемент, Расшифровка, СтандартнаяОбработка)
	
	Перем ВыполненноеДействие;
	
    СтандартнаяОбработка = Ложь;
	ОбработкаРасшифровки = Новый ОбработкаРасшифровкиКомпоновкиДанных(ДанныеРасшифровки, Новый ИсточникДоступныхНастроекКомпоновкиДанных(ПолучитьURLСхемы()));
	// ---------------------------------------------------------------------------- 
	
    ДоступныеДействия = Новый Массив();
    ДоступныеДействия.Добавить(ДействиеОбработкиРасшифровкиКомпоновкиДанных.ОткрытьЗначение);
	ДоступныеДействия.Добавить(ДействиеОбработкиРасшифровкиКомпоновкиДанных.Отфильтровать);
    
	// Осуществим выбор действия расшифровки пользователем
	ПОВ = Новый ОписаниеОповещения("ОбработкаВыбораДействияРасшифровки",ЭтотОбъект, Новый Структура("Расшифровка",Расшифровка)); 
	ОбработкаРасшифровки.ПоказатьВыборДействия(ПОВ,Расшифровка, ДоступныеДействия, , Истина);
   	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаВыбораДействияРасшифровки(ВыполненноеДействие, ПараметрВыполненногоДействия, ДополнительныеПараметры) Экспорт 
	// --- 
	
	Если (ВыполненноеДействие <> Неопределено) Тогда
		
		Если ВыполненноеДействие = ДействиеОбработкиРасшифровкиКомпоновкиДанных.ОткрытьЗначение Тогда
            ПоказатьЗначение(,ПараметрВыполненногоДействия);    
		ИначеЕсли ВыполненноеДействие = ДействиеОбработкиРасшифровкиКомпоновкиДанных.Отфильтровать Тогда 
            НовыеНастройки = ПрименитьНастройкиСКД(ДополнительныеПараметры.Расшифровка, ПараметрВыполненногоДействия);
		КонецЕсли;
		
		// --- 
		
		Если (НовыеНастройки <> Неопределено) Тогда
			
			// Пользователь выбрал действие, для которого нужно менять настройки
			Если ВыполненноеДействие = ДействиеОбработкиРасшифровкиКомпоновкиДанных.Отфильтровать ИЛИ 
				
				ВыполненноеДействие = ДействиеОбработкиРасшифровкиКомпоновкиДанных.Оформить Тогда
				Отчет.КомпоновщикНастроек.ЗагрузитьНастройки(НовыеНастройки);
				Отчет.АдресНастроек = _ПолучитьАдресНастроек();
				ЭтаФорма.СкомпоноватьРезультат();
				ОбработатьОтчет();
							
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЕсли; 
	
	// --- 
КонецПроцедуры
  

&НаСервере
Функция ПолучитьURLСхемы()
	
	ОсновнаяСхемаКомпоновкиДанных=РеквизитФормыВЗначение("Отчет").СхемаКомпоновкиДанных;
    URLСхемы = ПоместитьВоВременноеХранилище(ОсновнаяСхемаКомпоновкиДанных, ЭтаФорма.УникальныйИдентификатор);
    Возврат (URLСхемы);
	
КонецФункции

&НаСервере
Функция ПрименитьНастройкиСКД(Расшифровка, ПараметрВыполненногоДействия)
    
    ОбработкаРасшифровки     = Новый ОбработкаРасшифровкиКомпоновкиДанных(ДанныеРасшифровки, Новый ИсточникДоступныхНастроекКомпоновкиДанных(ПолучитьURLСхемы()));
    Возврат ОбработкаРасшифровки.ПрименитьНастройки(Расшифровка,ПараметрВыполненногоДействия);

КонецФункции

// ---------------------------------------------------------------------------- 

&НаСервере
Функция ПолучитьСписокПолейДляОтбораПоИнтервалу() Экспорт 

	сз = Новый СписокЗначений;
	сз.Добавить("Реквизит.ДатаСделкиФ", "Дата грузоперевозки", , БиблиотекаКартинок.CW_Грузоперевозки);
	сз.Добавить("Реквизит.ДатаЗакрытия", "Дата блокировки", , БиблиотекаКартинок.CW_Грузоперевозки);
			
	з = Новый Запрос(
		"ВЫБРАТЬ
		|	CW_ПараметрыГрузоперевозок.Ссылка,
		|	CW_ПараметрыГрузоперевозок.Наименование,
		|	CW_ПараметрыГрузоперевозок.ТипЗначения,
		|	CW_ПараметрыГрузоперевозок.Код
		|ИЗ
		|	ПланВидовХарактеристик.CW_ПараметрыГрузоперевозок КАК CW_ПараметрыГрузоперевозок
		|ГДЕ
		|	НЕ CW_ПараметрыГрузоперевозок.ЭтоГруппа"
	);
	рз = з.Выполнить();
	выб = рз.Выбрать();
	Пока выб.Следующий() Цикл
		Если выб.ТипЗначения.СодержитТип(Тип("Дата")) Тогда // выб.ТипЗначения это ОписаниеТипов, а не тип
			сз.Добавить(выб.Код,"(П) "+выб.Наименование, , БиблиотекаКартинок.ДиаграммаГанта);
		КонецЕсли;
	КонецЦикла;
	
	Возврат сз;

КонецФункции

// ---------------------------------------------------------------------------- 

&НаКлиенте
Процедура ВыборПериода(Команда)
	
	ПОВ = Новый ОписаниеОповещения("ОбработкаИзмененияПериода",ЭтотОбъект); 
	Диалог = Новый ДиалогРедактированияСтандартногоПериода();
	Диалог.Период = Период;
	Диалог.Период.ДатаНачала = НачалоПериода;
	Диалог.Период.ДатаОкончания = КонецПериода;
	Диалог.Период.Вариант = ВариантСтандартногоПериода.ПроизвольныйПериод;
	Диалог.Показать(ПОВ);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаИзмененияПериода(ОтветПериод, ДополнительныеПараметры) Экспорт 
	// --- 
	
	Если (ОтветПериод <> Неопределено) Тогда
		
		НачалоПериода = ОтветПериод.ДатаНачала;
		КонецПериода  = ОтветПериод.ДатаОкончания;
		Период = ОтветПериод;
		
	КонецЕсли; 
	
	// --- 
КонецПроцедуры

// ---------------------------------------------------------------------------- 

&НаСервере
Процедура ПриСохраненииПользовательскихНастроекНаСервере(Настройки)
	
	Настройки.ДополнительныеСвойства.Вставить("Показатели",Показатели);
	Настройки.ДополнительныеСвойства.Вставить("Группировки", Группировки); // ДанныеФормыКоллекция
	Настройки.ДополнительныеСвойства.Вставить("НачалоПериода",НачалоПериода);
	Настройки.ДополнительныеСвойства.Вставить("КонецПериода",КонецПериода);
	Настройки.ДополнительныеСвойства.Вставить("Отбор", Отчет.КомпоновщикНастроек.ПолучитьНастройки());
	
КонецПроцедуры

&НаСервере
Процедура ПриЗагрузкеПользовательскихНастроекНаСервере(Настройки)
	
	Если НЕ СформироватьПриОткрытии Тогда
		CW_Отчеты.ПриЗагрузкеПользовательскихНастроекНаСервере(ЭтаФорма, Настройки);
	КонецЕсли;
	
	Отчет.КомпоновщикНастроек.ПользовательскиеНастройки.ДополнительныеСвойства.Очистить();
	Настройки.ДополнительныеСвойства.Очистить();
	
КонецПроцедуры

// ---------------------------------------------------------------------------- 

&НаКлиенте
Процедура РазделыПриИзменении(Элемент)
	
	_УправлениеЭлементамиФормы();
	
КонецПроцедуры
